public class Poppy extends Flower {

    /**
     клас Poppy наслідує поля та методи класу Flower
     для наслідування пишемо ключове слово extends та назву класу,
     від якого будемо наслідуватись. В даному випадку Flower

     1. додано поле класу з іменем name
     2. поле текстове, тому вказано його тип як String
     3. згідно принципу Інкапсуляції забороняємо напряму доступ до поля класу напряму
     тому тут використано ідентифікатор доступу private
     в такому випадку доступ до поля name можливе лише в межах класу Poppy
    */
    private String name;

    /**
     1. додано геттер (спеціальний метод для читання значень поля/полів класу)
     2. геттери називають за принципом get+<ім'я поля класу з великої літери>
     3. тут public - ідентифікатор доступу, дає можливість доступатись до методу getName() з будь-якого місця програми
     4. String тут - тип значення, який повертає метод getName()
     5. return - ключове слово Java. Завжди пишеться у методах, які щось мають повернути.
     Якщо в таких виипадках його не вказувати, буде виникати помилка
    */
    public String getName() {
        return name;
    }

    /**
     1. додано сеттер (спеціальний метод для присвоєння значень для поля/полів класу)
     2. сеттери називають за аналогічним принципом set+<ім'я поля класу з великої літери>
     3. тут public - ідентифікатор доступу, дає можливість доступатись до методу setName() з будь-якого місця програми
     4. void тут вказує на те, що метод setName() не повертає нічого, тільки виконує те, що між { і }
     5. this - ключове слово Java. Вказує на те, що після крапки взято з цього класу
    */
    public void setName(String name) {
        if (name.length() > 100) {
            //...
        }
        this.name = name;
    }

}
